In [1]:
import numpy as np 
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6]
})

df1

   A  B
0  1  4
1  2  5
2  3  6

In [3]:
df1.shape  # returns a tuple of (number of rows, number of columns)

(3, 2)

In [4]:
df1.columns # returns the column labels of the DataFrame

Index(['A', 'B'], dtype='str')

In [5]:
df1.info() # provides a concise summary of the DataFrame, including data types and non-null counts

<class 'pandas.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
dtypes: int64(2)
memory usage: 180.0 bytes

In [6]:
df1.describe() # generates descriptive statistics of the DataFrame, such as mean, std, min, max, etc. for numeric columns

         A    B
count  3.0  3.0
mean   2.0  5.0
std    1.0  1.0
min    1.0  4.0
25%    1.5  4.5
50%    2.0  5.0
75%    2.5  5.5
max    3.0  6.0

In [7]:
df1['A'] + 10 # adds 10 to each element in column 'A' and returns a new Series

0    11
1    12
2    13
Name: A, dtype: int64

In [8]:
# defining a custom function to apply to each element in column 'B'
def square(x):
    return x ** 2

In [ ]:
df1['B'].apply(square) # applies the 'square' function to each element in column 'B' and returns a new Series (dont change the original DataFrame)

0    16
1    25
2    36
Name: B, dtype: int64

In [10]:
df1['B'] = df1['B'].apply(square) # applies the 'square' function to each element in column 'B' and updates the original DataFrame with the squared values

In [11]:
df1

   A   B
0  1  16
1  2  25
2  3  36

In [12]:
df1['D'] = df1['A'] * df1['B'] # creates a new column 'D' by multiplying columns 'A' and 'B' element-wise

In [13]:
df1

   A   B    D
0  1  16   16
1  2  25   50
2  3  36  108